Revit 2026 API

# MEPSystemTypeSystemClassification Property

---

Identifies the classification for the system type

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public MEPSystemClassification SystemClassification { get; }
```
```vb
Public ReadOnly Property SystemClassification As MEPSystemClassification
	Get
```
```cpp
public:
property MEPSystemClassification SystemClassification {
	MEPSystemClassification get ();
}
```
```fsharp
member SystemClassification : MEPSystemClassification with get
```

#### Property Value

MEPSystemClassification

The system classification drives certain behavior such as sizing and connections to other systems

#### Reference

MEPSystemType Class

Autodesk.Revit.DB Namespace